---
kind: enumMember
id: F:Autodesk.Revit.DB.BuiltInParameter.STAIRS_ENABLE_CALCULATION_RULE_CHECKING
enum: Autodesk.Revit.DB.BuiltInParameter
source: html/fb011c91-be7e-f737-28c7-3f1e1917a0e0.htm
---
# Autodesk.Revit.DB.BuiltInParameter.STAIRS_ENABLE_CALCULATION_RULE_CHECKING

"Enable Calculator Rules Check": Enable calculation rule checking